Autodesk.Revit.DB.SymbolicCurveArray
An array that contains model curves.

Autodesk.Revit.DB.SymbolicCurveArray.Insert(Autodesk.Revit.DB.SymbolicCurve,System.Int32)
System.Int32
Insert the specified model curve into the array.
item: The model curve to be inserted into the array.
index: The model curve will be inserted before this index.
Returns: Returns whether the model curve was inserted into the array.

Autodesk.Revit.DB.SymbolicCurveArray.GetEnumerator
System.Collections.IEnumerator
Retrieve a forward moving iterator to the array.
Returns: Returns a forward moving iterator to the array.

Autodesk.Revit.DB.SymbolicCurveArray.ReverseIterator
Autodesk.Revit.DB.SymbolicCurveArrayIterator
Retrieve a backward moving iterator to the array.
Returns: Returns a backward moving iterator to the array.

Autodesk.Revit.DB.SymbolicCurveArray.ForwardIterator
Autodesk.Revit.DB.SymbolicCurveArrayIterator
Retrieve a forward moving iterator to the array.
Returns: Returns a forward moving iterator to the array.

Autodesk.Revit.DB.SymbolicCurveArray.Append(Autodesk.Revit.DB.SymbolicCurve)
void
Add the model curve to the end of the array.
item: The model curve to be added.

Autodesk.Revit.DB.SymbolicCurveArray.Clear
void
Removes every model curve from the array, rendering it empty.

Autodesk.Revit.DB.SymbolicCurveArray.Size
System.Int32
get
Returns the number of model curves that are in the array.

Autodesk.Revit.DB.SymbolicCurveArray.Item(System.Int32)
Autodesk.Revit.DB.SymbolicCurve
Gets or sets a model curve at a specified index within the array.
index: The index of the model curve to be set or retrieved.
Returns: Returns the model curve at the specified index.

Autodesk.Revit.DB.SymbolicCurveArray.IsEmpty
System.Boolean
get
Test to see if the array is empty.
Remarks: If the array is empty then True will be returned, otherwise False.